Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: So that when it was God's desire to make it specially clear to those who by his word were to have the heritage, that his purpose was fixed, he made it more certain with an oath;
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏁᎳᏅᎯ ᎤᏚᎵᏍᎬ ᎤᏟ ᎢᎦᎢ ᎬᏂᎨᏒ ᎢᏧᏩᏁᏗᏱ ᎨᏥᏚᎢᏍᏓᏁᎸᎯ ᎾᏍᎩ ᎬᏩᏓᏁᏟᏴᏍᏗ ᏂᎨᏒᎾ ᎨᏒ ᏄᏍᏛ ᎠᏓᏅᏖᏍᎬᎢ, ᎠᏎᎵᏛᏍᎬ ᎤᏍᏓᏱᏍᏔᏁᎢ.

source: So that we, who have gone in flight from danger to the hope which has been put before us, may have a strong comfort in two unchanging things, in which it is not possible for God to be false;
chr: ᎠᎴ ᎾᏍᎩ ᏔᎵ ᏄᎵᏁᏨ ᏕᏛᏗᏍᎬ ᎾᏍᎩ ᎬᏩᏓᏁᏟᏴᏍᏗ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎾᎿ ᎬᏩᏥᎪᏗ ᏂᎨᏒᎾ ᏥᎨᎭ ᎤᏁᎳᏅᎯ, ᎠᏴ ᎢᎩᏲᎸᎯ ᏥᎩ ᎢᎦᏗᏍᎦᎶᏗᏱ, ᎤᎵᏂᎩᏛ ᎢᎩᎦᎵᏍᏓᏗᏍᎩ ᎨᎩᏩᏛᏗ ᎢᏳᎵᏍᏙᏗᏱ, ᎾᏍᎩ ᏗᎩᏂᏴᏗᏱ ᎤᏚᎩ ᎬᏗ ᎡᎩᏩᏌᏓᏁᎲᎢ;

source: And this hope is like a strong band for our souls, fixed and certain, and going in to that which is inside the veil;
chr: ᎾᏍᎩ ᎤᏚᎩ ᎬᏗ ᎨᏒ ᎾᏍᎩᏯ ᎠᏓᏅᏙ ᎦᎾᎯᏍᏙᏗ ᏥᎩ, ᎡᏍᎦ ᏂᎦᎵᏍᏗᏍᎬᎾ ᎠᎴ ᎬᏗᏏᏴᏍᏗ ᏂᎨᏒᎾ, ᎠᎴ ᎾᏍᎩ ᏥᏩᏴᎯᎭ ᎾᏍᎩ ᎠᏰᏙᎳᏛ ᎤᏗᏗᏢ;

source: Where Jesus has gone before us, as a high priest for ever after the order of Melchizedek.
chr: ᎾᎿ ᏥᏌ ᎢᎬᏱ ᎡᎩ ᏫᎩᏴᏎᎸᎯ ᏥᎩ, ᎾᏍᎩ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᏂᎪᎯᎸ ᎠᏥᎧᏅᎯ ᏥᎩ, ᎺᎵᎩᏏᏕᎩ ᏄᏍᏛ ᎾᏍᎩᏯᎢ.

source: For this Melchizedek, the king of Salem, a priest of the Most High God, who gave Abraham his blessing, meeting him when he came back after putting the kings to death,
chr: ᎯᎠᏰᏃ ᎾᏍᎩ ᎹᏓᎩᏏᏕᎩ, ᎤᎬᏫᏳᎯ ᏎᏓᎽ, ᎠᏥᎸ-ᎨᎶᎯ ᎨᏎᎢ ᎤᏁᎳᏅᎯ ᏩᏍᏛ ᎦᎸᎳᏗ ᎡᎯ ᎤᏤᎵᎦ, ᎾᏍᎩ ᎡᏆᎭᎻ ᏥᏚᏠᏎ ᏧᏨᏏᏗᏒ ᏫᏚᎰᏅᎯ ᎤᏂᎬᏫᏳᎯ, ᎠᎴ ᎣᏍᏛ ᏧᏁᏤᎴᎢ;

source: And to whom Abraham gave a tenth part of everything which he had, being first named King of righteousness, and then in addition, King of Salem, that is to say, King of peace;
chr: ᎠᎴ ᎾᏍᎩ ᎾᏍᏉ ᎡᏆᎭᎻ ᏂᎦᏛ ᏧᎬᏩᎶᏗ ᎠᏰᎲ ᎠᏍᎪᎯᏁ ᎪᏣᎴᏛ ᏧᏁᎸᏁᎢ; ᎢᎬᏱᏱ ᎨᏒ [ᏚᏙᎥ] ᎠᏁᏢᏔᏅᎯ ᎨᏒ ᎤᎬᏫᏳᎯ ᏚᏳᎪᏛ ᎢᏯᏛᏁᎯ ᎦᏛᎦ, ᎣᏂᏃ ᎾᏍᏉ ᏎᎳᏂ ᎤᎬᏫᏳᎯ ᎠᎪᏎᎭ, ᎾᏍᎩ ᎤᎬᏫᏳᎯ ᏅᏩᏙᎯᏯᏛ ᎤᏚᎵᏍᎩ ᏥᎦᏛᎦ.

source: Being without father or mother, or family, having no birth or end to his life, being made like the Son of God, is a priest for ever.
chr: ᎾᏍᎩ ᎤᏤᏓ ᎠᎴ ᎤᏥ ᎾᏁᎲᎾ ᏥᎨᏎ, ᎤᎾᏁᏢᏔᏅᎯ ᎠᏂᏂᎩᏛ ᏥᎨᏎ, ᏚᎩᏨᏁᎬ ᏅᎫᏓᎴᏅᎲᎾ ᏥᎨᏎ, ᎠᎴ ᎡᎲ ᏭᏍᏗᏥᎯᏍᏗ ᏂᎨᏒᎾ ᏥᎨᏎᎢ, ᎤᏁᎳᏅᎯᏍᎩᏂ ᎾᏪᏥ ᎾᏍᎩᏯ ᏥᎾᎬᏁᎴᎢ, ᎠᏥᎸ-ᎨᎶᎯ ᏤᎭ ᏂᎪᎯᎸᎢ.

source: Now see how great this man was, to whom our father Abraham gave a tenth part of what he had got in the fight.
chr: ᎡᏣᏓᏅᏛᎵᎾᏗ ᏂᎦᎥ ᎠᏥᎸᏉᏗᏳ ᎨᏒ ᎯᎠ ᎾᏍᎩ ᎠᏍᎦᏯ, ᎾᏍᎩ ᎠᎦᏴᎵᎨ ᎡᏆᎭᎻ ᎤᏩᏒ ᎠᏍᎪᎯᏁ ᎪᏣᎴᏛ ᎤᏓᏬᏅᏛ ᎠᏰᎲ ᎤᏁᎸᎢ.

source: And it is true that by the law, those of the sons of Levi who have the position of priests may take a tenth part of the people's goods; that is to say, they take it from their brothers though these are the sons of Abraham.
chr: ᎠᎴ ᎤᏙᎯᏳᎯ ᎵᏫ ᏧᏪᏥ ᎠᏥᎸᎨᎳᏍᏗ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒ ᎨᏥᏁᏗ ᎨᏒᎢ ᎨᎦᏒᎦᎸᏗᏍᎨ ᎠᏍᎪᎯᏁ ᎪᏣᎴᏛ ᏧᏂᏂᏢᏗᏱ ᏴᏫ ᎾᏍᎩᏯ ᏂᎬᏅ ᏗᎧᎿᏩᏛᏍᏗ, ᎾᏍᎩ ᎠᎾᎵᏅᏟ ᎨᏒᎢ, ᎾᏍᏉ ᎡᏆᎭᎻ ᎠᏰᎵ ᏅᏓᏳᎾᏓᎴᏅᎯ ᎨᏒᎢ.

source: But this man, who was not of their family, took the tenth from Abraham, and gave a blessing to him to whom God had given his undertaking.
chr: ᎾᏍᎩᏍᎩᏂ Ꮎ ᎤᎾᏁᏢᏔᏅᏛ ᎨᏒ ᎵᏫ ᎠᏂᎳᏍᏓᎸ ᏅᏧᏓᎴᏅᎲᎾ ᏥᎩ, ᎠᏍᎪᎯᏁ ᎪᏣᎴᏛ ᏚᏓᏂᎸᏤᎴ ᎡᏆᎭᎻ, ᎠᎴ ᎣᏍᏛ ᎤᏁᏤᎴ ᎠᏚᎢᏍᏔᏅᎯ ᎨᏒ ᏣᎦᎨᏅᏯ.

source: But there is no doubt that the less gets his blessing from the greater.
chr: ᎠᎴ ᏄᏜᏏᏛᏒᎾ ᎡᏍᎦ ᎢᏯᏥᎸᏉᏗ ᎨᏒ ᎣᏍᏛ ᎤᏁᏤᎰ ᎤᏟ ᎢᏯᏥᎸᏉᏗ.

source: Now at the present time, men over whom death has power take the tenth; but then it was taken by one of whom it is witnessed that he is living.
chr: ᎠᎴ ᎠᏂ ᏴᏫ ᏗᏂᏲᎱᏍᎩ ᏥᎩ ᎠᏍᎪᎯᏁ ᎪᏣᎴᏛ ᎢᎨᏥᏁᎰᎢ; ᎾᎿᏍᎩᏂ ᎤᎩᏎᎢ ᎾᏍᎩ Ꮎ ᎡᎭ ᎠᎪᏎᎸᎯ ᏥᎩ.

source: And we may say that in Abraham, even Levi, who has a right to take the tenth part, gave it;
chr: ᎠᎴ ᎯᎠᏉ ᏱᎾᎩᏪᏒ, ᎵᏫ ᎾᏍᏉ ᎠᏍᎪᎯᏁ ᎪᏣᎴᏛ ᏗᏓᏂᎸᎩ ᏥᎩ, ᎠᏍᎪᎯᏁ ᎪᏣᎴᏛ ᎤᎫᏴᎮ ᎾᎯᏳ ᎡᏆᎭᎻ ᎤᎫᏴᎲ.

source: Because he was still in his father's body when Melchizedek came to him.
chr: ᎠᏏᏉᏰᏃ ᎤᏙᏓ ᎠᏰᎸ ᎠᏯᎡᎢ ᎾᎯᏳ ᎹᎵᎩᏏᏕᎩ ᏥᏚᏠᏍᎨᎢ.

source: Now if it was possible for things to be made complete through the priests of the house of Levi (for the law was given to the people in connection with them), what need was there for another priest who was of the order of Melchizedek and not of the order of Aaron?
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏳᏃ ᎠᏥᎸᎨᎳᏍᏗ ᎨᏒ ᎠᏂᎵᏫ ᏥᎨᎦᏒᎦᎶᏕ, ᏅᏍᎦᏅᎾ ᎢᎬᏩᏓᏛᏁᏗ ᏱᎨᏎᎢ, (ᎠᏥᎸ-ᎨᎳᏍᏗᏰᏃ ᎨᏒ ᎠᎴ ᏗᎧᎿᏩᏛᏍᏗ ᏚᎾᏚᏓᏖ ᏴᏫ ᎦᎾᏓᏂᎸᏨ) ᎦᏙᏃ ᎠᏏ ᎤᏚᎸᏗ ᏂᎦᎵᏍᏗᏍᎨ ᏅᏩᏓᎴ ᎠᏥᎸᎨᎶᎯ ᎤᎾᏄᎪᎢᏍᏗᏱ ᎹᎵᎩᏏᏕᎩ ᏄᏍᏛ ᎾᏍᎩᏯᎢ, ᎡᎳᏂᏃ ᎾᏍᎩᏯ ᎦᏰᎪᏎᏗ ᏂᎨᏒᎾ ᎨᏒᎢ?

source: Because if the priests are changed, it is necessary to make a change in the law.
chr: ᎠᏥᎸ-ᎨᎳᏍᏗᏰᏃ ᎨᏒ ᎤᏓᏁᏟᏴᏛ ᎨᏒᎢ, ᎠᏎ ᎾᏍᏉ ᎦᏁᏟᏴᏛ ᏂᎦᎵᏍᏗᎭ ᏗᎧᎿᏩᏛᏍᏗ.

source: For he of whom these things are said comes of another tribe, of which no man has ever made offerings at the altar.
chr: ᎾᏍᎩᏰᏃ Ꮎ ᎯᎠ ᎾᏍᎩ ᎤᎬᏩᎵ ᎠᏥᏁᎢᏍᏔᏅᎯ ᎨᏒ ᎤᏣᏘᏂ ᎠᏂᎳᏍᏓᎸ ᎨᎳ ᎨᏒᎩ, ᎾᏍᎩ [ᎠᏂᎳᏍᏓᎸ] ᎤᏓᎴᏅᎯ ᎥᏝ ᎩᎶ ᎠᏥᎸᎨᎳᏍᏗᏱ ᏱᏚᎸᏫᏍᏓᏁᎮᎢ.

source: Because it is clear that our Lord comes out of Judah, and Moses said nothing about priests from that tribe.
chr: ᎬᏂᎨᏒᎢᏳᏰᏃ ᏂᎦᎵᏍᏗᎭ ᎾᏍᎩ ᎢᎦᏤᎵ ᎤᎬᏫᏳᎯ ᏧᏓ ᎠᏂᎳᏍᏓᎸ ᏧᏓᎴᏅᎲᎢ; ᎾᏍᎩ ᎠᏂᎳᏍᏓᎸ ᎼᏏ ᎥᏝ ᏱᏚᏁᎢᏍᏔᏁ ᎠᏥᎸ-ᎨᎳᏍᏗ ᎨᏒ ᎤᎬᏩᎵ.

source: And this is even more clear if a second priest has come up who is like Melchizedek,
chr: ᎠᎴ ᎠᏏ ᎤᏟ ᎬᏂᎨᏒ ᏂᎦᎵᏍᏗᎭ, ᎢᏳᏃ ᎺᎵᎩᏏᏕᎩ ᏄᏍᏛ ᎾᏍᎩᏯ ᏅᏩᏓᎴ ᎠᏥᎸ-ᎨᎶᎯ ᏱᎦᎾᏄᎪᎦ,

source: That is to say, not made by a law based on the flesh, but by the power of a life without end:
chr: ᎾᏍᎩ ᎠᏥᎩ-ᎨᎶᎯ ᎾᎬᏁᎸ ᏗᎧᎿᏩᏛᏍᏗ ᎤᏇᏓᎵ ᎤᎬᏩᎵ ᎾᏍᎩᏯ ᎾᎬᏁᎸᎾ ᎨᏒᎢ, ᎬᏂᏛᏍᎩᏂ ᎠᎵᏍᏆᏗᏍᎩ ᏂᎨᏒᎾ ᎤᎵᏂᎬᎬ ᎾᏍᎩᏯᎢ.

source: For it has been witnessed of him, You are a priest for ever after the order of Melchizedek.
chr: ᎯᎠᏰᏃ ᏂᎦᏪᎭ ᎧᏁᎬᎢ, ᎠᏥᎸᎮᎶᎯ ᎨᎭ ᏂᎪᎯᎸᎢ ᎺᎵᎩᏏᏕᎩ ᏄᏍᏛ ᎾᏍᎩᏯᎢ.

source: So the law which went before is put on one side, because it was feeble and without profit.
chr: ᎤᏙᎯᏳᎯᏰᏃ ᎢᏴᏛ ᎢᎬᏁᎸᎯ ᏂᎦᎵᏍᏗᎭ ᎢᎬᏱᏱ ᎤᎵᏁᏨᎯ ᏗᎧᎿᏩᏛᏍᏗ, ᎠᏩᏂᎦᎳᎯᏳ ᎨᏒ ᎠᎴ ᎬᏩᏓᏍᏕᎸᏗ ᏂᎨᏒᎾ ᎨᏒ ᎢᏳᏍᏗ.

source: (Because the law made nothing complete), and in its place there is a better hope, through which we come near to God.
chr: ᏗᎧᎿᏩᏛᏍᏗᏰᏃ ᎥᏝ ᎦᎷᎶᎩ ᏂᎨᏒᎾ ᎢᎬᏁᎯ ᏱᎨᏎ ᎪᎱᏍᏗ; ᎤᏟᏍᎩᏂ ᎢᏝᏍᏛ ᎤᏚᎩ ᎬᏗ ᎨᏒ ᎠᏴᏔᏂᎸᎯ ᏥᎩ, ᎾᏍᎩ ᎢᏛᏗᏍᎬ ᎾᎥ ᎦᏰᏗᎷᏤᏗ ᏥᏂᎦᎵᏍᏗᎭ ᎤᏁᎳᏅᎯ ᎦᎷᎶᎩ ᏂᎨᏒᎾ ᏂᎬᏁᎭ.

source: And as this is not without the taking of an oath
chr: ᎠᎴ ᎾᏍᎩ ᎠᏎᎵᏔᏅᎯ ᎨᏒ ᎬᏔᏅᎯ ᏥᎩ [ᎦᎶᏁᏛ ᎠᏥᎸ-ᎨᎶᎯ ᎢᏯᎬᏁᎸᎯ ᏥᎩ,]

source: (For those were made priests without an oath, but this one was made a priest with an oath by him who says of him, The Lord gave his oath, which he will not take back, that you are a priest for ever);
chr: (ᎾᏍᎩᏰᏃ Ꮎ ᎠᏥᎸ-ᎠᏁᎶᎯ ᏂᎨᎬᏁᎮ ᎠᏎᎵᏔᏅᎯ ᏂᎨᏒᎾ; ᎯᎠᏍᎩᏂ Ꮎ ᎠᏎᎵᏔᏅᎯ ᎨᏒ ᎠᎬᏓᏁᎴᎢ, ᎯᎠ ᎾᏍᎩ ᎢᏳᏪᏎᎸᎯ, ᎤᎬᏫᏳᎯ ᎤᏎᎵᏔᏅ ᎠᎴ ᎥᏝ ᎠᎦᏁᏟᏴᎾ ᏂᎯ ᎠᏥᎸ-ᎮᎶᎯ ᏂᎪᎯᎸᎢ ᎺᎵᎩᏏᏕᎩ ᏄᏍᏛ ᎾᏍᎩᏯᎢ.)

source: By so much is it a better agreement which we have through Jesus.
chr: ᎾᏍᎩᏯ ᎢᏴᏛ ᎤᎶᏒᏍᏗ ᏔᎵ ᎠᏛᏗᏍᎩ ᏫᎬᏁᎴ ᏥᏌ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ.

source: And it is true that there have been a great number of those priests, because death does not let them go on for ever;
chr: ᎠᎴ ᎾᏍᎩ Ꮎ ᎯᎠ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎤᏂᏣᏛᎩ, ᎥᏝᏰᏃ ᎪᎯᏛ ᎬᏩᎾᏕᏗ ᏱᎨᏎ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎢᏳᏍᏗ.

source: But this priest, because his life goes on for ever, is unchanging.
chr: ᎯᎠᏍᎩᏂ [ᎠᏍᎦᏯ] ᎠᎵᏍᏆᏗᏍᎩ ᏂᎨᏒᎾ ᏤᎭ ᎤᎶᏏᎲᏍᏗ ᏂᎨᏒᎾ ᎠᏥᎸ-ᎨᎶᎯ ᎨᏒᎢ.

source: So that he is fully able to be the saviour of all who come to God through him, because he is ever living to make prayer to God for them.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏂᎪᎯᎸ ᏰᎵᏉ ᎾᏍᏉ ᏗᎬᏩᏍᏕᎸᏗ ᎾᏍᎩ Ꮎ ᎤᏩᏒ ᎬᏩᎷᎯᏍᏓᏁᎯ ᎤᏁᎳᏅᎯ ᎠᏂᎷᏤᎲᎢ, ᏫᎾᏍᏛᎾᏰᏃ ᎡᎭ ᏧᎵᏍᏗᏰᏓᏁᏗᏱ.

source: It was right for us to have such a high priest, one who is holy and without evil, doing no wrong, having no part with sinners, and made higher than the heavens:
chr: ᎾᏍᎩᏰᏃ ᎢᏳᏍᏗ ᎠᏥᎸ-ᎨᎶᎯ ᎢᎩᎵᎶᎲᏍᎩ ᎨᏒᎩ, ᎾᏍᎩ ᎾᏍᎦᏅᎾ, ᎤᏲ ᎢᎬᏩᏓᏛᏁᏗ ᏂᎨᏒᎾ, ᎠᏍᎦᎾ ᏄᏓᏅᎦᎸᎾ, ᎠᏂᏍᎦᎾ ᎠᏁᎲ ᎠᎦᏓᏓᎴᏔᏅᎯ, ᎠᎴ ᎦᎸᎶ ᎤᏗᏗᏢ ᎢᏴᏛ ᎠᏥᏌᎳᏓᏅᎯ;

source: Who has no need to make offerings for sins every day, like those high priests, first for himself, and then for the people; because he did this once and for ever when he made an offering of himself.
chr: ᎾᏍᎩ Ꮎ ᎤᏚᎸᏗ ᏄᎵᏍᏓᏁᎲᎾ ᏂᏚᎩᏨᏂᏒ ᎠᏥᎸ-ᎤᏪᎳᏍᏗᏱ, ᎾᏍᎩ ᎾᎾᏛᏁᎲ ᏄᏂᎬᏫᏳᏌᏕᎩ ᎠᏥᎸᎠᏁᎶᎯ, ᎢᎬᏱ ᎤᏅᏒ ᎤᏂᏍᎦᏅᏨ ᎠᎫᏴᏙᏗ, ᎢᏉᏃ ᏴᏫ ᎤᏂᏍᎦᏅᏨ ᎠᎫᏴᏙᏗ; ᎾᏍᎩᏰᏃ ᎯᎠ ᏌᏉ ᏄᏛᏁᎴᎢ, ᎾᎯᏳ ᎤᏩᏒ ᎤᏓᎵᏍᎪᎸᏔᏅ.

source: The law makes high priests of men who are feeble; but the word of the oath, which was made after the law, gives that position to a Son, in whom all good is for ever complete.
chr: ᏗᎧᎿᏩᏛᏍᏗᏰᏃ ᏴᏫ ᏗᏂᏩᎾᎦᎳ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᏄᏅᏁᎰᎢ; ᎧᏁᏨᎯᏍᎩᏂ ᎠᏎᎵᏔᏅᎯ ᎠᏍᏓᏱᏗᏍᏔᏅᎯ ᎨᏒᎢ, ᎾᏍᎩ ᏗᎧᎿᏩᏛᏍᏗ ᎤᎵᏁᏨ ᎣᏂ ᏧᎵᏁᏤᎢ, ᎤᏪᏥ [ᎠᏥᎸᎨᎶᎯ] ᏄᏩᏁᎴ ᎾᏍᎩ ᏂᎪᎯᎸ ᎦᎷᎶᎩ ᏂᎨᏒᎾ ᏥᎩ.

source: Now of the things we are saying this is the chief point: We have such a high priest, who has taken his place at the right hand of God's high seat of glory in heaven,
chr: ᎾᏍᎩᏃ ᎯᎠ ᏥᏗᏃᎮᎭ, ᎯᎠ ᎾᏍᎩ Ꮀ ᏄᎬᏫᏳᏒ ᏂᎦᎵᏍᏗᎭ; ᎾᏍᎩ ᏄᏍᏗ ᎢᎩᎧᎭ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ, ᎾᏍᎩ ᎠᎦᏘᏏᏗᏢ ᎦᎸᏉᏗᏳ ᎦᏍᎩᎸ ᎦᎸᎶᎢ ᎤᏪᏅ;

source: As a servant of the holy things and of the true Tent, which was put up by God, not by man.
chr: ᏧᎸᏫᏍᏓᏁᎯ ᎦᎸᏉᏗᏳ ᏗᎨᏒᎢ ᎠᎴ ᎤᏙᎯᏳᎯ ᏗᎦᎵᏦᏛᎢ, ᎾᏍᎩ ᎤᎬᏫᏳᎯ ᎤᎵᏦᏔᏅᎯ ᎨᏒᎢ, ᎥᏝᏃ ᏴᏫ.

source: Now every high priest is given authority to take to God the things which are given and to make offerings; so that it is necessary for this man, like them, to have something for an offering.
chr: ᎾᏂᎥᏰᏃ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎨᏥᏁᏤᎸᎯ ᎨᏐ ᏧᎾᎵᏍᎪᎸᏙᏗᏱ ᎠᏓᏁᏗ ᎨᏒ ᎠᎴ ᎠᏥᎸ-ᏗᎨᎳᏍᏙᏗ ᎨᏒᎢ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎯᎠ ᎾᏍᎩ ᎠᏍᎦᏯ ᎾᏍᏉ ᎠᏎ ᎪᎱᏍᏗ ᎤᏲᎯᏍᏗ ᎨᏎ ᎤᎵᏍᎪᎸᏙᏗ.

source: If he had been on earth he would not have been a priest at all, because there are other priests who make the offerings ordered by the law;
chr: ᎢᏳᏰᏃ ᎡᎶᎯ ᏱᎦᏰᎮᎢ, ᎥᏝ ᎠᏥᎸᎨᎶᎯ ᏱᎦᎨᏎᎢ, ᎢᎠᏁᎭᏰᏃ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᏓᏁᏗ ᎨᏒ ᎠᎾᎵᏍᎪᎸᏗᏍᎩ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎬᏅ ᎾᏍᎩᏯᎢ;

source: Being servants of that which is a copy and an image of the things in heaven, as Moses, when he was about to make the Tent, had special orders from God: for, See, he said, that you make everything like the design which you saw in the mountain.
chr: ᎾᏍᎩ ᎾᎿ ᏥᏚᏂᎸᏫᏍᏓᏁᎭ ᏗᏟᎶᏍᏔᏅᎯ ᎠᎴ ᎤᏓᏩᏗᏍᏙᏛ ᎦᎸᎳᏗ ᎡᎯ ᎦᎵᏦᏛᎢ, ᎾᏍᎩᏯ [ᎤᏁᎳᏅᎯ] ᎼᏏ ᏧᏁᏤᎴ ᎾᎯᏳ ᎦᎵᏦᏙᏗ ᏨᏗᎪᏢᏂᏎᎢ; ᎭᎦᏌᏯᏍᏔᏅᎭ ᏧᏛᏁᎢ, ᏕᎰᏢᏍᎬ ᏂᎦᏛ ᏧᏓᎴᏅᏛ ᎾᏍᎩᏯ ᏗᏟᎶᏍᏙᏗ ᎠᎲ ᎾᏍᎩ ᏤᏣᎾᏄᎪᏫᏎᎸ ᎣᏓᎸ ᏅᏁᎸᎭ.

source: But now his position as priest is higher. because through him God has made a better agreement with man, based on the giving of better things.
chr: ᎾᏍᎩᏃ ᏥᏄᏍᏗ ᎪᎯ ᎨᏒ ᎤᏟ ᎢᎦᎸᏉᏗ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒ ᎤᏩᏛᎲ, ᏅᏗᎦᎵᏍᏙᏗᎭ ᎠᏰᎵ ᎠᎴᎲᏍᎩ ᎨᏒ ᎤᏟ ᎢᏲᏍᏛ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛ ᎤᎬᏩᎸᎢ, ᎾᏍᎩ ᎤᏟ ᎢᏲᏍᏛ ᏓᏚᎢᏍᏛ ᏧᎵᏍᏓᏱᏍᏗ.

source: For if that first agreement had been as good as possible, there would have been no place for a second.
chr: ᎢᏳᏰᏃ ᎢᎬᏱᏱ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛ ᎦᎫᎯᏍᏙᏗ ᏂᎨᏒᎾ ᏱᎨᏎᎢ, ᎥᏝ ᏅᏩᏓᎴ ᎧᏃᎮᏛ ᏗᏠᎯᏍᏙᏗᏱ ᏱᎬᏩᏂᏔᏲᎴᎢ.

source: For, protesting against them, he says, See, the days are coming when I will make a new agreement with the house of Israel, and with the house of Judah;
chr: ᎡᏍᎦᏰᏃ ᎤᏰᎸᏅ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎬᏂᏳᏉ, ᏛᏍᏆᎸᎯ, ᎠᏗᎭ ᎤᎬᏫᏳᎯ, ᎾᏍᎩ ᎢᏤ ᎧᏃᎮᏛ ᏗᎦᏥᏯᏠᎢᏍᏓᏁᏗᏱ ᎢᏏᎵ ᏏᏓᏁᎸᎯ ᎨᏒ ᎠᎴ ᏧᏓ ᏏᏓᏁᎸᎯ ᎨᏒᎢ.

source: Not like the agreement which I made with their fathers when I took them by the hand, to be their guide out of the land of Egypt; for they did not keep the agreement with me, and I gave them up, says the Lord.
chr: ᎥᏝ ᎾᏍᎩᏯ ᎧᏃᎮᏛ ᏕᎦᏥᏯᏠᎢᏍᏓᏁᎸ ᏧᏂᎦᏴᎵᎨᎢ, ᎾᎯᏳ ᎦᏂᏲᏯᏁᏒ ᎦᏥᏄᎪᏫᏍᏗᏱ ᎢᏥᏈᏱ ᎦᏓ ᎠᎲᎢ; ᎥᏝᏰᏃ ᏳᏂᏍᏆᏂᎪᏔᏁ ᎧᏃᎮᏛ ᏕᎦᏥᏯᏠᎢᏍᏓᏁᎸᎢ, ᎠᎴ ᎠᏴ ᎥᏝ ᏱᎦᏥᏯᎦᏌᏯᏍᏔᏁᎢ, ᎠᏗᎭ ᎤᎬᏫᏳᎯ.

source: For this is the agreement which I will make with the people of Israel after those days: I will put my laws into their minds, writing them in their hearts: and I will be their God, and they will be my people:
chr: ᎯᎠᏰᏃ ᎾᏍᎩ ᏄᏍᏕᏍᏗ ᎧᏃᎮᏛ ᏙᏓᎦᏥᏯᏠᎢᏍᏓᏁᎵ ᎢᏏᎵ ᏏᏓᏁᎸᎯ ᎨᏒ ᎾᎯᏳ ᎦᎶᏐᏅᎭ ᎠᏗᎭ ᎤᎬᏫᏳᎯ; ᏚᎾᏓᏅᏛ ᏓᏓᏥᎳᏂ ᏗᏆᏤᎵ ᏗᎧᎿᏩᏛᏍᏗ, ᎠᎴ ᏧᏂᎾᏫᏱ ᏙᏓᎪᏪᎳᏂ; ᎠᎴ ᎠᏴ ᎦᏥᏯᏁᎳᏅᎯ ᎨᏎᏍᏗ, ᎤᏅᏒᏃ ᏗᏆᏤᎵ ᏴᏫ ᎨᏎᏍᏗ;

source: And there will be no need for every man to be teaching his brother, or his neighbour, saying, This is the knowledge of the Lord: for they will all have knowledge of me, great and small.
chr: ᎥᏝ ᎠᎴ ᎩᎶ ᎠᏏᏴᏫ ᎨᏒ ᎾᎥ ᎢᏧᎾᏓᎵ, ᎠᎴ ᏗᎾᏓᏅᏟ ᎨᏒ ᏱᎨᏲᎲᏍᎨᏍᏗ, ᎯᎠ ᏱᏂᎦᏪᏍᎨᏍᏗ, ᎯᎦᏙᎥᎯ ᎤᎬᏫᏳᎯ; ᎾᏂᎥᏉᏰᏃ ᎬᎩᎦᏔᎯᏳ ᎨᏎᏍᏗ, ᎤᏍᏗᎧᏂ ᎡᎲ ᏅᏓᎬᏩᏓᎴᏅᏛ, ᎤᏟ ᎢᏯᏥᎸᏉᏗ ᎡᎲ ᏫᎬᏍᏗ.

source: And I will have mercy on their evil-doing, and I will not keep their sins in mind.
chr: ᏓᎦᏥᏯᏙᎵᏥᏰᏃ ᎤᏣᏘᏂ ᏄᎾᏛᏁᎸᎢ, ᎤᏂᏍᎦᏅᏨᏃ ᎠᎴ ᎤᏲ ᏄᎾᏛᏁᎵᏙᎸ ᎥᏝ ᎿᏉ ᎠᏆᏅᏓᏗᏍᏗ ᏱᎨᏎᏍᏗ.

source: When he says, A new agreement, he has made the first agreement old. But anything which is getting old and past use will not be seen much longer.
chr: ᎾᏍᎩᏃ ᏌᏉ ᎢᏤ ᏥᎪᏎᎭ, ᏐᎢ ᎤᏪᏘ ᏂᎬᏁᎭ. ᎪᎱᏍᏗᏰᏃ ᎤᏪᏘ ᎢᎬᏁᎸᎯ ᎠᎴ ᎤᏪᏔᏨᎯ ᏥᎨᏐ, ᎤᏲᏥᏕᏅ ᎨᏐᎢ.

source: Now the first agreement had its rules of worship, and a holy order.
chr: ᎠᎴᏬ ᎤᏙᎯᏳᎯ ᎢᎬᏱᏱ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛ ᏗᎧᎿᏩᏛᏍᏗ ᏕᎪᏢᏒᎩ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎤᎬᏩᎵ, ᎠᎴ ᎡᎶᎯ ᎡᎯ ᎦᎸᏉᏗᏳ ᎦᎵᏦᏛᎢ.

source: For the first Tent was made ready, having in it the vessels for the lights and the table and the ordering of the bread; and this is named the holy place.
chr: ᎦᎵᏦᏙᏗᏰᏃ ᎤᏃᏢᏁᎢ, ᎦᎸᏉᏗᏳ ᎨᏒ ᏣᏃᏎᎮᎢ, ᎾᎿ ᎢᎬᏱᏱ ᏓᏓᎯᏛᎢ, ᏥᎦᎧᎮ ᎠᏨᏍᏙᏗ ᎦᎪᏗᏱ, ᎠᎴ ᎦᏍᎩᎶᎢ, ᎠᎴ ᎾᎿ ᏣᏝᎮ ᎠᎦᏙᏗ ᎦᏚ;

source: And inside the second veil was the place which is named the Holy of holies;
chr: ᏔᎵᏁᏃ ᎠᏰᏙᎳᏛ ᎤᏗᏗᏢ ᎯᎠ ᎾᏍᎩ ᎦᎵᏦᏛᎢ ᎤᏟ ᎢᎦᎸᏉᏗ ᏣᏃᏎᎮᎢ;

source: Having a vessel of gold in it for burning perfumes, and the ark of the agreement, which was covered with gold and which had in it a pot made of gold for the manna, and Aaron's rod which put out buds, and the stones with the writing of the agreement;
chr: ᎾᏍᎩ ᎾᎿ ᏣᎮ ᎪᎱᏍᏗ ᎬᏙᏗ ᎠᏕᎸ-ᏓᎶᏂᎨ ᎪᏢᏔᏅᎯ ᎦᏩᏒᎩ ᎠᏥᎸᎨᎳᏍᏗ ᎦᎶᏗ, ᎠᎴ ᎾᎿ ᏥᏥᏰ ᎦᏁᏌᎢ ᏗᎧᎿᏩᏛᏍᏗ ᏗᎦᎶᏗᏱ ᎠᏕᎸ-ᏓᎶᏂᎨ ᎫᏢᏔᏃᏅᎯ ᏥᎨᏎᎢ, ᎾᎿᏂ ᏥᎦᎴ ᎠᏕᎸ-ᏓᎶᏂᎨ ᎪᏢᏔᏅᎯ ᎠᏖᎵᏙ ᎹᎾ ᏥᎦᎶᏕᎢ, ᎠᎴ ᎡᎳᏂ ᎤᏙᎳᏅᏍᏙᏗ ᏣᏥᎸᏍᎨᎢ, ᎠᎴ ᏅᏯ ᏗᏯᏖᏅ ᎾᎿ ᏥᎪᏪᎴ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ.

source: And over it were the winged ones of glory with their wings covering the mercy-seat; about which it is not possible now to say anything in detail.
chr: ᎠᎴ [ᎦᏁᏌᎢ] ᏥᏴ ᎦᎸᎳᏗᏢ ᎠᏂᎩᎷᏫ ᎦᎸᏉᏗᏳ ᎢᏯᏅᏁᎯ, ᎾᏍᎩ ᏧᏄᏢᏕ ᎦᏁᏌᎢ ᎫᏢᏗ; ᎾᏍᎩ ᎤᎬᏩᎵ ᎥᏝ ᎪᎯ ᎨᏒ ᏂᎦᏛ ᎦᏁᎢᏍᏙᏗ ᏱᎩ.

source: Now while these things were in existence, the priests went into the first Tent at all times, for prayer and the making of offerings.
chr: ᎯᎠᏃ ᎾᏍᎩ ᎣᏍᏛ ᎢᎬᏁᎰᏅᎯ ᎨᏎᎢ, ᎠᏥᎸ-ᎠᏁᎶᎯ ᏂᎪᎯᎸ ᏩᏂᏴᎯᎮ ᎢᎬᏱᏱ ᏓᏓᎯᏢ ᎦᎵᏦᏛᎢ, ᏫᏚᏂᎸᏫᏍᏓᏁᎮ [ᎤᏁᎳᏅᎯ] ᎤᏤᎵ ᎤᎬᏩᎵ.

source: But only the high priest went into the second, once a year, not without making an offering of blood for himself and for the errors of the people:
chr: ᏔᎵᏁᏍᎩᏂ ᏫᎦᎵᏦᏛ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᎤᏩᏒ ᏌᏉ ᏫᎾᏴᎯᎮ ᏂᏓᏕᏘᏴᎯᏒᎢ, ᎥᏝ ᎠᎴ ᎩᎬ ᏂᎦᏁᏤᎲᎾ ᏱᎨᏎᎢ, ᎾᏍᎩ ᎤᏩᏒ ᎤᏍᎦᏅᏨ ᎠᎫᏴᏙᏗ, ᎠᎴ ᎤᏂᏣᏘ ᏴᏫ ᎤᏂᏍᎦᏅᏨ ᎠᎫᏴᏙᏗ.

source: The Holy Spirit witnessing by this that the way into the holy place had not at that time been made open, while the first Tent was still in being;
chr: ᎾᏍᎩ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎯᎠ ᏄᏍᏕ ᎬᏂᎨᏒ ᏂᎬᏁᎮᎢ, ᎾᏍᎩ Ꮎ ᎤᏟ ᎢᎦᎸᏉᏗ ᏗᎨᏒ ᏫᎦᏅᏅ ᎠᏏ ᎬᏂᎨᏒ ᎢᎬᏁᎸᎯ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎠᏏᏉ ᏥᏂᎬᏩᏍᏕ ᎢᎬᏱᏱ ᎦᎵᏦᏛᎢ;

source: And this is an image of the present time; when the offerings which are given are not able to make the heart of the worshipper completely clean,
chr: ᎾᏍᎩ ᎦᎵᏦᏛ ᏗᏟᎶᏍᏔᏅᎯᏉ ᏥᎨᏎ ᎾᎯᏳ ᎨᏒᎢ, ᎾᎿᏂ ᏥᏓᎾᎵᏍᎪᎸᏗᏍᎨ ᎠᏓᏁᏗ ᎨᏒ ᎠᎴ ᎾᏍᏉ ᎠᏥᎸ-ᎨᎳᏍᏙᏗ, ᎾᏍᎩ Ꮎ ᎢᏳᏛᏁᎸᎯ ᏰᎵ ᎾᏍᎦᏅᎾ ᎢᎬᏩᏁᏗ ᏂᎨᏒᎾ ᏥᎨᏎ ᎠᏓᏅᏙ ᎤᎬᏩᎵ ᎨᏒᎢ;

source: Because they are only rules of the flesh, of meats and drinks and washings, which have their place till the time comes when things will be put right.
chr: ᎾᏍᎩ ᏗᎵᏍᏓᏴᏗᏱᏉ ᎨᏒ ᎠᎴ ᎠᏗᏔᏍᏗᏱᏉ ᎨᏒ ᎠᎴ ᏗᎪᏑᎴᏗᏱ ᎨᏒᎢ, ᎠᎴ ᏗᎧᎿᏩᏛᏍᏗ ᎤᏇᏓᎵᏉ ᎨᏒ ᏧᎬᏩᎴᎢ, ᎾᏍᎩ ᎢᏳᎾᏛᏁᏗ ᏥᏂᎨᎬᏁᎴ ᎤᏓᏁᏟᏴᏍᏗ ᎨᏒ ᎤᎵᏰᎢᎶᎯᏍᏗ ᎨᏒ ᎢᎪᎯᏛ.

source: But now Christ has come as the high priest of the good things of the future, through this greater and better Tent, not made with hands, that is to say, not of this world,
chr: ᎦᎶᏁᏛᏍᎩᏂ ᎤᎷᏨᎯ ᏥᎩ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᎢᏳᎵᏍᏔᏅᎯ ᏧᎸᏫᏍᏓᏁᏗᏱ ᎣᏍᏛ ᎨᏒ ᎤᎬᏩᎵ ᎤᎵᏰᎢᎶᎯᏍᏗ ᏥᎨᏒᎩ, ᎾᏍᎩ ᎬᏗᏍᎬ ᎢᏟ ᎢᎦᎸᏉᏗ ᎠᎴ ᏂᎦᎷᎶᏥᏙᎲᎾ ᎦᎵᏦᏛᎢ, ᎩᎶ ᏧᏬᏰᏂ ᏧᏮᏔᏅᎯ ᏂᎨᏒᎾ ᎤᏬᏢᏅᎯ, ᎾᏍᎩ ᏯᏛᏅ, ᎠᏁᎳᏅᎯ ᏂᎨᏒᎾ ᎨᏒᎢ,

source: And has gone once and for ever into the holy place, having got eternal salvation, not through the blood of goats and young oxen, but through his blood.
chr: ᎥᏝ ᎠᎴ ᏴᏫ ᏗᏂᎭᏄᎸᎯ ᎠᎴ ᏩᎦ ᎠᏂᎩᎾ ᎤᏂᎩᎬ ᎬᏗᏍᎬᎢ, ᎤᏩᏒᏍᎩᏂ ᎤᎩᎬ ᎬᏗᏍᎬᎢ, ᏌᏉ ᏄᏴᎴ ᎦᎸᏉᏗᏳ ᏗᎨᏒᎢ, ᎿᏉ ᎾᏍᎩ ᏫᎾᏍᏛᎾ ᎠᎫᏴᏙᏗ ᎢᎩᏩᏛᎡᎸ.

source: For if the blood of goats and oxen, and the dust from the burning of a young cow, being put on the unclean, make the flesh clean:
chr: ᎢᏳᏰᏃ ᏩᎦ ᏧᎾᎪᏅᏍᏓᎵ ᎤᏂᎩᎬ, ᎠᎴ ᎠᏫ ᏗᏂᎭᏄᎸᎯ ᎤᏂᎩᎬ, ᎠᎴ ᏩᎦ ᎠᎩᏏ ᎤᎪᏅᎯ ᎪᏍᏚ ᏕᎨᏥᏆᏲᎥᏍᎬ ᎠᏂᎦᏓᎭ, ᎾᏂᏍᎦᏅᎾ ᎢᎬᏩᏅᏁᏗ ᏱᎩ ᎾᏍᎩ ᎤᏂᏇᏓᎸ ᎤᎬᏩᎵ ᎨᏒᎢ.

source: How much more will the blood of Christ, who, being without sin, made an offering of himself to God through the Holy Spirit, make your hearts clean from dead works to be servants of the living God?
chr: ᎢᎳᎪ ᎢᏴᏛ ᎢᎦᎢ ᎤᏟᎯᏳ ᎦᎶᏁᏛ ᎤᎩᎬ, ᏗᏣᏓᏅᏙ ᏙᏓᏥᏅᎦᎸᎡᎵ ᏙᏓᏥᎧᎲᏏ ᎠᏓᎯᎯ ᏕᏥᎸᏫᏍᏓᏁᎲᎢ, ᎬᏂᏛᏃ ᎤᏁᎳᏅᎯ ᏤᏣᏁᎶᏙᏗᏱ ᏅᏓᏨᏁᎵ ᎾᏍᎩ ᏫᎾᏍᏛᎾ ᎡᎯ ᎠᏓᏅᏙ ᎬᏗᏍᎬ ᏄᏓᏅᎦᎸᎾ [ᎠᏍᎦᎾ,] ᎦᎶᏁᏛ ᎤᏩᏒ ᎤᏓᎵᏍᎪᎸᏔᏅᎯ ᏥᎩ ᎤᏁᎳᏅᎯ ᎤᏓᎵᏍᎪᎸᏓᏁᎸᎯ ᏥᎩ?

source: And for this cause it is through him that a new agreement has come into being, so that after the errors under the first agreement had been taken away by his death, the word of God might have effect for those who were marked out for an eternal heritage.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᏰᎵ ᎠᎴᎲᏍᎩ ᏂᎦᎵᏍᏗᎭ ᎢᏤ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ, ᎾᏍᎩ ᎤᏲᎱᏒᎯ ᎨᏒ ᎬᏗᏍᎬ ᏗᎬᏭᏓᎴᏍᏗ ᎢᏳᏓᏍᏙᏗᏱ ᎢᎬᏱᏱ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛ ᎤᏂᏲᏍᏔᏅᎢ, ᎾᏍᎩ ᎨᏥᏯᏅᏛ ᏥᎩ ᎤᎾᏤᎵ ᎢᏳᎵᏍᏙᏗᏱ ᎠᏚᎢᏍᏛ ᏫᎾᏍᏛᎾ ᎤᎾᏘᏯᏍᏓᏁᏗ ᎨᏒᎢ;

source: Because where there is a testament, there has to be the death of the man who made it.
chr: ᎧᏃᎮᏛᏰᏃ ᏗᏠᎯᏍᏔᏅᎯ ᏥᎨᏐᎢ, ᎠᏎ ᎠᎯᏍᏗ ᎨᏐ ᎠᏍᏓᏱᏗᏍᎩ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ.

source: For a testament has effect after death; for what power has it while the man who made it is living?
chr: ᎧᏃᎮᏛᏰᏃ ᏓᏠᎯᏍᏛ ᎠᏍᏓᏱᏳ ᎨᏐ ᎠᎵᏍᎪᎸᏙᏗ ᎨᏒ ᎠᎸᎯ ᏥᎨᏐᎢ; ᎥᏝ ᎠᎴ ᎠᏍᏓᏱᏛᎯ ᏱᎨᏐ ᎠᎵᏍᎪᎸᏙᏗ ᎠᏏᏉ ᏥᎬᏃᎢ.

source: So that even the first agreement was not made without blood.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᎬᏱᏱ ᎧᏃᎮᏛ ᏗᏠᎯᏍᏔᏅᎯ ᎨᏒ ᎥᏝ ᎠᏍᏓᏱᏛᎯ ᏱᎨᏎ ᎩᎬ ᎬᏔᏅᎾ ᏂᎨᏒᎾ ᏱᎩ.

source: For when Moses had given all the rules of the law to the people, he took the blood of goats and young oxen, with water and red wool and hyssop, and put it on the book itself and on all the people,
chr: ᎼᏏᏰᏃ ᏂᎦᏛ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎦᏪᏍᎬ ᏚᎾᏄᎪᏫᏎᎸ ᏴᏫ ᎾᏍᎩᏯ ᏂᎬᏅ ᏗᎧᎿᏩᏛᏍᏗ, ᏩᎦ ᎠᏂᎩᎾ ᎤᏂᎩᎬ ᎠᎴ ᎠᏫ ᏗᏂᎭᏄᎸᎯ ᎤᏂᎩᎬ ᎤᏁᎩᏎᎢ, ᎠᎴ ᎠᎹ ᎠᎴ ᎤᏩᏅ ᎩᎦᎨᎢ, ᎠᎴ ᏗᏐᏈ, ᏚᏍᏚᏞᏃ ᎪᏪᎵ ᎠᎴ ᎾᏂᎥ ᏴᏫ.

source: Saying, This blood is the sign of the agreement which God has made with you.
chr: ᎯᎠ ᏂᏪᏍᎨᎢ, ᎯᎠ ᎾᏍᎩ ᎩᎬ, ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛ ᎠᏍᏓᏱᏗᏍᎩ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏥᏥᏁᏤ ᏗᏥᎧᎿᏩᏛᏍᏗᏱ.

source: And the blood was put on the Tent and all the holy vessels in the same way.
chr: ᎠᎴ ᎾᏍᏉ ᎩᎬ ᏚᏍᏚᏟᏍᏔᏁ ᎦᎵᏦᏛᎢ, ᎠᎴ ᏂᎦᏛ ᎪᎱᏍᏗ ᏗᎬᏔᏂᏓᏍᏗ ᏚᏂᎸᏫᏍᏓᏁᎲᎢ.

source: And by the law almost all things are made clean with blood, and without blood there is no forgiveness.
chr: ᎠᎴ ᏂᎦᎥᏉ ᎢᏳᏍᏗ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎬᏅ ᎩᎬ ᎦᏅᎦᎸᏙᏗ ᎨᏒᎩ; ᎠᎴ ᎩᎬ ᎠᏨᏅᎯ ᏂᎨᏒᎾ ᏱᎩ, ᎠᏍᎦᏅᏨ ᎥᏝ ᏴᎦᏴᏓᏗᏙᎵᎩ.

source: For this cause it was necessary to make the copies of the things in heaven clean with these offerings; but the things themselves are made clean with better offerings than these.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏚᎸᏗ ᏂᎦᎵᏍᏗᏍᎬᎩ ᎯᎠ ᎾᏍᎩ ᏂᎦᏛ ᏄᏍᏗᏓᏅ ᎦᎸᎳᏗ ᏤᎯ ᏗᏟᎶᏍᏔᏅᎯ ᎨᏒ ᏗᎦᏅᎦᎸᏙᏗᏱ ᎯᎠ ᎾᏍᎩ (ᏗᎵᏍᎪᎸᏙᏗ,) ᎦᎸᎳᏗᏍᎩᏂ ᏤᎯ ᎨᏒ ᎾᏲᎪ ᎤᏟ ᎢᏗᎦᎸᏉᏗ ᏗᎵᏍᎪᎸᏔᏅᎯ ᏗᎦᏅᎦᎸᏙᏗ.

source: For Christ did not go into a holy place which had been made by men's hands as the copy of the true one; but he went into heaven itself, and now takes his place before the face of God for us.
chr: ᎦᎶᏁᏛᏰᏃ ᎥᏝ ᏱᏭᏴᎸ ᎦᎸᏉᏗᏳ ᏕᎨᏒᎢ ᎩᎶ ᏧᏬᏰᏂ ᏧᏮᏔᏅᎯ ᏧᏬᏢᏅᎯ ᎨᏒᎢ, ᎾᏍᎩ ᎤᏙᎯᏳᎯ (ᎦᎸᏉᏗᏳ ᎨᏒ) ᏗᏟᎶᏍᏔᏅᎯ ᎨᏒᎢ; ᎦᎸᎳᏗᏍᎩᏂ ᏂᎨᏒ ᏭᏴᎸ, ᎪᎯ ᎨᏒ ᎤᏁᎳᏅᎯ ᎠᎦᏔᎲ ᎬᏂᎨᏒ ᎢᎦᏛᏁᏗᏱ;

source: And he did not have to make an offering of himself again and again, as the high priest goes into the holy place every year with blood which is not his;
chr: ᎠᎴ ᎥᏝ ᎤᏚᎸᏗ ᏂᎦᎵᏍᏗᏍᎬ ᎢᏳᏍᏗ ᎢᏴᏛᎭᏉ ᎤᏓᎵᏍᎪᎸᏙᏗᏱ, ᎾᏍᎩᏯ ᏂᏓᏕᏘᏴᎮᎬ, ᎪᎱᏍᏗ ᎤᏂᎩᎬ ᎬᏗ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᏥᎾᏛᏁᎮ ᎦᎸᏉᏗᏳ ᎨᏒ ᏥᏩᏴᎯᎮᎢ;

source: For then he would have undergone a number of deaths from the time of the making of the world: but now he has come to us at the end of the old order, to put away sin by the offering of himself.
chr: ᎢᏳᏰᏃ ᎾᏍᎩ ᏱᏄᏍᏕᎢ ᎿᏉ ᎤᏣᏘ ᎠᏎ ᎢᏳᎩᎵᏲᏨᎯ ᏱᏂᎦᎵᏍᏗᏍᎨ ᎡᎶᎯ ᏧᏙᏢᏅ ᏅᏓᎬᏩᏓᎴᏅᏛ; ᎪᎯᏍᎩᏂ ᎨᏒ ᎤᏩᏒ ᎠᏓᎵᏍᎪᎸᏗᏍᎬ ᎠᏍᎦᏂ ᎨᏒ ᎠᎲᏍᎬᎢ ᏌᏉ ᎬᏂᎨᏒ ᏄᏓᏛᏁᎸ ᎤᎵᏍᏆᎸᏗ ᏕᎨᏌᏗᏒᎢ.

source: And because by God's law death comes to men once, and after that they are judged;
chr: ᎠᎴ ᏧᎦᎪᏔᏅᎯ ᏥᎩ ᏴᏫ ᏌᏉ ᎢᏧᏂᏲᎯᏍᏗᏱ, ᎣᏂᏃ ᏗᎫᎪᏙᏗ ᎢᎦ ᎨᏒᎢ;

source: So Christ, having at his first coming taken on himself the sins of men, will be seen a second time, without sin, by those who are waiting for him, for their salvation.
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᎦᎶᏁᏛ ᏌᏉ ᎢᏯᎦᎵᏍᎪᎸᏔᏅᎯ ᎤᎩᏍᏗᏱ ᎤᏂᏣᏘ ᎨᏒ ᎤᏂᏍᎦᏅᏨᎢ; ᎾᏍᎩᏃ Ꮎ ᎬᏩᎦᏖᏃᎯ ᎨᏒ ᏔᎵᏁ ᎬᏂᎨᏒ ᏂᏙᏛᎠᏛᏁᎵ ᏧᏍᏕᎸᏗᏱ, ᎠᏍᎦᏂ ᎠᎫᏴᏙᏗ ᎾᏰᎲᎾ

source: For the law, being only a poor copy of the future good things, and not the true image of those things, is never able to make the people who come to the altar every year with the same offerings completely clean.
chr: ᏗᎧᎿᏩᏛᏍᏗᏰᏃ ᎣᏍᏛ ᎤᎵᏰᎢᎶᎯᏍᏗ ᎨᏒ ᎤᏓᏩᏗᏍᏙᏛ ᏧᏪᎲᎩ, ᎠᎴ ᎠᎧᎵᎢ ᏗᏟᎶᏍᏔᏅᎯ ᏂᎨᏒᎾ ᏥᎨᏒᎩ, ᎥᏝ ᏰᎵᎦ, ᎾᏍᎩ ᏗᏓᏍᎪᎸᏙᏗ ᏓᏅᏗᏍᎬ, ᏂᏓᏕᏘᏴᎯᏒ ᏂᎪᎯᎸ ᏥᏓᎾᎵᏍᎪᎸᏗᏍᎨᎢ ᎾᎿ ᎠᏂᎷᎩ ᏄᏂᎪᎸᎾ ᎢᎬᏩᏅᏁᏗ ᏱᎨᏎᎢ.

source: For if this had been possible, would there not have been an end of those offerings, because the worshippers would have been made completely clean and would have been no longer conscious of sins?
chr: ᎢᏳᏰᏃ ᏰᎵᏉ ᏱᎨᏎᎢ, Ꮭ ᏱᎬᏩᏂᏲᎯᏍᏔᏁ ᏧᎾᎵᏍᎪᎸᏗᏍᎬᎢ; ᎠᎾᎵᏍᎪᎸᏗᏍᎩᏰᏃ ᎨᏒ ᏌᏉ ᏱᏄᎾᏓᏅᎦᎸᎮ ᎥᏝ ᎿᏉ ᎠᏂᏍᎦᎾ ᏱᎬᏩᏂᏰᎸᏎᎢ.

source: But year by year there is a memory of sins in those offerings.
chr: ᎾᏍᎩᏍᎩᏂ Ꮎ ᏓᎾᎵᏍᎪᎸᏗᏍᎬᎢ, ᏂᏓᏕᏘᏴᎯᏒ ᎤᎾᏅᏓᏗᏏᏐᏗᏉ ᏂᎦᎵᏍᏗᏍᎪ ᎤᏂᏍᎦᏅᏨᎢ.

source: Because it is not possible for the blood of oxen and goats to take away sins.
chr: ᎥᏝᏰᏃ ᏩᎦ ᏧᎾᎪᏅᏍᏓᎵ ᎠᎴ ᎠᏫ ᏗᏂᎭᏄᎸᎯ ᎤᏂᎩᎬ ᏰᎵ ᎬᏩᏂᎲᏍᏗ ᏱᎨᏎ ᎠᏍᎦᏂ ᎨᏒᎢ.

source: So that when he comes into the world, he says, You had no desire for offerings, but you made a body ready for me;
chr: ᎾᏍᎩ ᎢᏳᏍᏗ (ᎦᎶᏁᏛ) ᎡᎶᎯ ᎤᎾᏄᎪᏥᎸ, ᎯᎠ ᏄᏪᏎᎢ, ᎠᏥᎸ-ᎨᎳᏍᏙᏗ ᎠᎴ ᎢᎵᏍᎪᎸᏙᏗ ᎨᏒ ᎥᏝ ᏰᎵ ᏱᏗᏣᏰᎸᏁᎢ, ᎠᏰᎸᏍᎩᏂ ᏍᏆᏛᏅᎢᏍᏓᏁᎸ.

source: You had no joy in burned offerings or in offerings for sin.
chr: ᏧᏃᏍᏛ ᎠᏥᎸ-ᏗᎨᎳᏍᏙᏗ ᎠᎴ ᏗᎵᏍᎪᎸᏙᏗ ᎠᏍᎦᏂ ᎠᎫᏴᏙᏗ ᎥᏝ ᎣᏏᏳ ᏱᏗᏣᏰᎸᏁᎢ;

source: Then I said, See, I have come to do your pleasure, O God (as it is said of me in the roll of the book).
chr: ᎿᏉᏃ ᎯᎠ ᎾᎩᏪᏒᎩ, ᎬᏂᏳᏉ ᏥᎷᎩ, [ᎪᏪᎵᎯ ᎪᏪᎳ ᎥᎩᏃᎮᏍᎬᎢ,] [ᏥᎷᎩ] ᏄᏍᏛ ᏣᏚᎵᏍᎬ ᎢᏯᏆᏛᏁᏗ Ᏹ, ᏣᏁᎳᏅᎯ.

source: After saying, You had no desire for offerings, for burned offerings or offerings for sin (which are made by the law) and you had no pleasure in them,
chr: ᎦᏳᎳ ᎯᎠ ᎢᏳᏪᏛ ᏥᎩ, ᎠᏥᎸᎨᎳᏍᏙᏗ ᎠᎴ ᎠᎵᏍᎪᎸᏙᏗ, ᎠᎴ ᏧᏃᏍᏗ ᎠᏥᎸ-ᏗᎨᎳᏍᏙᏗ, ᎠᎴ ᏗᎵᏍᎪᎸᏙᏗ ᎠᏍᎦᏂ ᎠᎫᏴᏙᏗ, ᎥᏝ ᏰᎵ ᏱᏗᏣᏰᎸᏁᎢ, ᎥᏝ ᎠᎴ ᎣᏏᏳ ᏱᏗᏣᏰᎸᏁᎢ; ᎾᏍᎩ ᏗᎧᎿᏩᏛᏍᏗ ᎾᏍᎩᏯ ᏂᎬᏅ ᏗᎵᏍᎪᎸᏔᏅᎯ ᏥᎨᏎᎢ;

source: Then he said, See, I have come to do your pleasure. He took away the old order, so that he might put the new order in its place.
chr: ᎿᏉ ᎯᎠ ᏄᏪᏎᎢ, ᎬᏂᏳᏉ, ᏥᎷᎩ ᏄᏍᏛ ᏣᏚᎵᏍᎬ ᎢᏯᏆᏛᏁᏗᏱ ᏣᏁᎳᏅᎯ. ᎢᎬᏱᏱ [ᎤᏁᎢᏍᏔᏅ] ᎠᏲᏍᏗᎭ, ᎾᏍᎩ ᏔᎵᏁ [ᎤᏁᎢᏍᏔᏅ] ᎤᏍᏓᏱᏗᏍᏗᏱ.

source: By that pleasure we have been made holy, by the offering of the body of Jesus Christ once and for ever.
chr: [ᎤᏁᎳᏅᎯᏰᏃ] ᎣᏏᏳ ᎤᏰᎸᏗ ᎡᎩᏅᎦᎸᏗᏱ ᏥᏌ ᎦᎶᏁᏛ ᎠᏰᎸ ᏌᏉ ᎢᏯᎵᏍᎪᎸᏔᏅᎯ ᎨᏒ ᎢᏳᏩᏂᏌᏛ.

source: And every priest takes his place at the altar day by day, doing what is necessary, and making again and again the same offerings which are never able to take away sins.
chr: ᎠᎴ ᎾᏂᎥ ᎠᏥᎸ-ᎠᏁᎶᎯ ᏓᏂᏙᎨ ᏚᏂᎸᏫᏍᏓᏁᎮ ᏂᏓᏙᏓᏈᏒᎢ, ᎠᎴ ᏂᎪᎯᎸ ᎤᏠᏱᏉ ᎠᏥᎸ-ᏗᎨᎳᏍᏙᏗ ᏧᎾᎵᏍᎪᎸᏗᏍᎨᎢ, ᎾᏍᎩ ᎠᏍᎦᏂ ᎨᏒ ᎢᎸᎯᏳ ᏰᎵ ᎬᏩᎲᏍᏗ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: But when Jesus had made one offering for sins for ever, he took his place at the right hand of God;
chr: ᎯᎠᏍᎩᏂ ᎠᏍᎦᏯ ᏌᏉ ᎢᏳᎵᏍᎪᎸᏔᏅᎯ ᎨᏎ ᎠᏥᎸ-ᎨᎳᏍᏙᏗ ᎠᏍᎦᏂ ᎠᎫᎪᏙᏗ, ᎤᏪᏁ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ ᎠᎦᏗᏏᏗᏢ ᎤᏁᎳᏅᎯ ᎤᏬᎸᎢ;

source: And has been waiting there from that time, till all who are against him are made a foot-rest for his feet.
chr: ᎠᎴ ᎿᏉ ᏂᎪᎯᎸ ᎠᎦᏘᏯ ᎬᏂ ᎬᏩᏍᎦᎩ ᏧᎳᏏᏗᏱ ᎦᏍᎩᎶ ᏂᎨᎬᏁᎸᎭ.

source: Because by one offering he has made complete for ever those who are made holy.
chr: ᏌᏉᏰᏃ ᎢᏳᎵᏍᎪᎸᏔᏅᎯ ᎨᏒ ᎤᏮᏔᏅ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ ᏄᏂᎪᎸᎾ ᏂᏚᏩᏁᎸ ᎾᏍᎩ Ꮎ ᎾᏂᏍᎦᏅᎾ ᎢᎨᎬᏁᎸᎯ.

source: And the Holy Spirit is a witness for us: for after he had said,
chr: ᎠᎴ ᎾᏍᏉ ᎦᎸᏉᏗ ᎠᏓᏅᏙ ᎣᎪᎯᏳᏓᏁᎯ; ᎦᏳᎳᏰᏃ ᎯᎠ ᎾᏍᎩ ᎢᏳᏪᏛ ᏂᎨᏐᎢ,

source: This is the agreement which I will make with them after those days, says the Lord; I will put my laws in their hearts, writing them in their minds; he said,
chr: ᎯᎠ ᎾᏍᎩ ᏄᏍᏕᏍᏗ ᎧᏃᎮᏛ ᏙᏓᎦᏥᏯᏠᎢᏍᏓᏁᎵ ᎾᎯᏳ ᎦᎶᏐᏅᎭ ᎠᏗᎭ ᎤᎬᏫᏳᎯ; ᏗᏆᏤᎵ ᏗᎧᎿᏩᏛᏍᏗ ᏧᏂᎾᏫᏱ ᏙᏓᏥᎳᏂ, ᎠᎴ ᏚᎾᏓᏅᏛ ᏙᏓᎪᏪᎳᏂ.

source: And I will keep no more memory of their sins and of their evil-doings.
chr: ᎠᎴ ᎤᏂᏍᎦᏅᏨ ᎠᎴ ᎤᏲ ᏄᎾᏛᏁᎵᏙᎸ ᎥᏝ ᎿᏉ ᎠᏆᏅᏓᏗᏍᏗ ᏱᎨᏎᏍᏗ.

source: Now where there is forgiveness of these, there is no more offering for sin.
chr: ᎾᏍᎩᏃ ᎯᎠ ᎾᏍᎩ ᎠᏍᎦᏅᏨᎯ ᎨᏒ ᎦᏴᏓᏗᏁᎸᎯ ᏱᎩ, ᎥᏝ ᎿᏉ ᎠᏍᎦᏂ ᎠᎫᏴᏙᏗ ᎠᎵᏍᎪᎸᏙᏗ ᏱᏂᎦᎵᏍᏗᎭ.

source: So then, my brothers, being able to go into the holy place without fear, because of the blood of Jesus,
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎢᏓᎵᏅᏟ, ᏂᏗᎾᏰᏍᎬᎾ ᏫᎨᎩᏴᏍᏗ ᏥᏄᎵᏍᏔᎤ ᎤᏟ ᎢᎦᎸᏉᏗᎨᏒ ᏥᏌ ᎤᎩᎬ ᎢᏳᏩᏂᏌᏅᎯ.

source: By the new and living way which he made open for us through the veil, that is to say, his flesh;
chr: ᎾᏍᎩ Ꮎ ᎢᏤ ᎠᎴ ᎬᏂᏛ ᎠᏓᏁᎯ ᎦᏅᏅ ᎬᏔᏅᎯ, ᎾᏍᎩ ᎢᎩᏍᏓᏱᏕᎸᎯ ᏥᎩ ᎠᏰᏙᎳᏛ ᎤᎶᏒᎢ, ᎾᏍᎩ ᎤᏇᏓᎸ ᏥᎦᏛᎦ;

source: And having a great priest over the house of God,
chr: ᎠᎴ [ᏥᎩᎧᎭ] ᏄᎬᏫᏳᏌᏕᎩ ᎠᏥᎸ-ᎨᎶᎯ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎠᏓᏁᎸ ᎤᎦᏌᏯᏍᏗᏕᎩ;

source: Let us go in with true hearts, in certain faith, having our hearts made free from the sense of sin and our bodies washed with clean water:
chr: ᎾᎥ ᎢᏗᎷᎨᏍᏗ ᎢᏛᏗᏍᎨᏍᏗ ᏄᏠᎾᏍᏛᏅ ᏗᎩᎾᏫ, ᎠᎴ ᎤᎵᏂᎩᏛ ᎪᎯᏳᏗ ᎨᏒᎢ, ᎠᎴ ᏗᎩᎾᏫ ᏤᎩᏍᏚᏞᎸᎯ ᏤᎩᏅᎦᎸᎯ ᎤᏲ ᎠᏓᏅᏖᏗ ᎨᏒᎢ, ᎠᎴ ᏗᏗᏰᎸ ᎦᏓᎭ ᏂᎨᏒᎾ ᎠᎹ ᏤᎪᏑᎴᏓᏁᎸᎯ.

source: Let us keep the witness of our hope strong and unshaking, for he is true who has given his word:
chr: ᎠᏍᏓᏯ ᏕᎩᏂᏴᏎᏍᏗ ᎬᏂᎨᏒ ᏂᎬᏁᎸ ᎤᏚᎩ ᎢᎬᏒ ᏂᎦᏜᏏᏛᎡᎲᎾ; ᏄᏓᎵᏓᏍᏛᎾᏰᏃ ᎾᏍᎩ Ꮎ ᎤᏚᎢᏍᏔᏅᎯ ᎨᏒᎢ.

source: And let us be moving one another at all times to love and good works;
chr: ᎠᎴ ᏕᏓᏓᏓᏅᏖᏍᎨᏍᏗ, ᎠᏓᎨᏳᏗ ᎨᏒ ᎠᎴ ᏱᏍᏛ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒ ᏗᎦᏓᏂᎳᏕᏗᏱ ᏗᎩᏄᏫᏍᏓᏁᏗᏱ;

source: Not giving up our meetings, as is the way of some, but keeping one another strong in faith; and all the more because you see the day coming near.
chr: ᏞᏍᏗᏉ ᏱᏗᏑᎵᎪᎨᏍᏗ ᎢᏓᏓᏟᏌᏂᏙᎲᎢ, ᎢᎦᏛ ᎾᏍᎩ ᎢᏳᎾᏛᏁᏗ ᏥᎩ; ᏕᏣᏓᏬᏁᏗᏍᎨᏍᏗᏍᎩᏂ; ᎠᎴ Ꮀ ᎤᎬᏫᏳᏎᏍᏗ, ᎾᏍᎩ ᏂᏣᏛᏁᎮᏍᏗ ᏥᏥᎪᏩᏗ ᎤᏍᏆᎸᎯᏗᏒ ᎾᎯᏳ ᎢᎦ.

source: For if we do evil on purpose after we have had the knowledge of what is true, there is no more offering for sins,
chr: ᎢᏳᏰᏃ ᎢᎬᏒ ᎢᎦᏚᎸᏛ ᏱᏗᏍᎦᏅᎬ ᏚᏳᎳ ᎨᎩᎦᏁᎥᏒᎯ ᏚᏳᎪᏛ ᎨᏒᎢ, ᎥᏝ ᏅᏩᏓᎴ ᏯᎵᏃᎯᏯ ᎠᏥᎸ-ᎨᎳᏍᏗ ᎠᏍᎦᏂ ᎠᎫᏴᏙᏗ,
